<?php

/**
 * 常量配置文件
 */

return [

    //产品领域配置
    'field' => [
        1 => '智能硬件',
        2 => '消费电子',
        3 => '交通工具',
        4 => '工业设备',
        5 => '厨电厨具',
        6 => '医疗设备',
        7 => '家具用品',
        8 => '办公用品',
        9 => '大家电',
        10 => '小家电',
        11 => '卫浴',
        12 => '玩具',
        13 => '体育用品',
        14 => '军工设备',
        15 => '户外用品',
    ],

    //行业配置
    'industry' => [
        1 => '制造业',
        2 => '消费零售',
        3 => '信息技术',
        4 => '能源',
        5 => '金融地产',
        6 => '服务业',
        7 => '医疗保健',
        8 => '原材料',
        9 => '工业制品',
        10 => '军工',
        11 => '公用事业',
    ],

    //奖项配置
    'prize' => [
        1 => '德国红点设计奖',
        2 => '德国IF设计奖',
        3 => 'IDEA工业设计奖',
        4 => '中国红星奖',
        5 => '中国红棉奖',
        6 => '台湾金点奖',
        7 => '香港DFA设计奖',
        8 => '日本G-Mark设计奖',
        9 => '韩国好设计奖',
        10 => '新加坡设计奖',
        11 => '意大利—Compasso d`Oro设计奖',
        12 => '英国设计奖',
        20 => '其他',
    ],
];